export const instructionForPopup = [
  'Привет! Сейчас мы расскажем как тут все работает!',
  'Просто загрузи свое изображение на нужное поле нанесения, кликни или тапни по нему и отрегулируй по размеру и конкретному месту.',
  'Конструктор принимает изображения в формате .jpg и .png',
  'Большим файлам может потребоваться некоторое время на загрузку.',
  'В процессе регулировки конструктор покажет примерные размеры и стоимость печати. Когда все готово нажми “Добавить в корзину” и оформи заказ.',
  'Наши дизайнеры свяжутся с вами после оформления и подкорректируют заказ перед печатью при необходимости.',
];
