// title_italicFirst и title_italicLast созданы для добавления первого и последнего слова курсивом.
// Использовать можно любой из ключей или несколько, компонент в результате соберет слова в одну строку

export const accordionData = {
  data: [
    {
      id: '0',
      title: 'Срочные',
      title_italicLast: 'заказы',
      content:
                'Мы предоставляем возможность заказать срочную печать на футболках без потери качества. Оформить заказ можно полностью онлайн любым удобным для вас способом: на сайте, по телефону или в мессенджере. Вместе мы сможем реализовать ваши планы и достичь желаемого результата.',
    },
    {
      id: '1',
      title_italicFirst: 'Качество',
      title: 'печати',
      content:
                'Мы гордимся качеством нашей печати на текстиле. Используем передовые технологии и материалы, чтобы гарантировать четкость и долговечность каждого изображения.',
    },
    {
      id: '2',
      title: 'Удобство',
      content:
                'Наш онлайн-конструктор — удобный инструмент, который позволяет визуализировать ваш готовый принт на одежде.  Вы можете загрузить свое изображение и расположить его на футболке, худи или свитшоте так, как вам нужно. Так вы сможете увидеть, как будет выглядеть готовое изделие с вашим принтом, и внести все необходимые корректировки до его финальной отправки в печать.',
    },
    {
      id: '3',
      title_italicFirst: 'Бланк',
      content:
                'Мы предлагаем печать не только на футболках, но и на другой одежде, включая толстовки и худи. У вас есть возможность выбрать свой идеальный стиль и модель, чтобы создать полностью уникальный комплект, отражающий вашу индивидуальность.',
    },
    {
      id: '4',
      title_italicFirst: 'Услуги',
      content:
                'Мы предоставляем полный спектр услуг, включая создание макета с помощью нашего дизайнера, подбор текстиля, нанесение печати и доставку. Вам не нужно беспокоиться о деталях — мы позаботимся о каждом шаге, чтобы вы получили идеальный продукт.',
    },
    {
      id: '5',
      title: 'Каталог',
      content: [
        {
          id: '0',
          item: 'На нашем сайте представлен каталог различных моделей футболок, толстовок и другой одежды, которую мы сами изготавливаем из качественных материалов на нашей фабрике PINHEAD в Санкт-Петербурге. Мы предлагаем разнообразие размеров, цветов и стилей, чтобы вы могли найти именно то, что вам нужно.',
        },
        {
          id: '1',
          item: 'Печать на футболках — это ваш шанс выделиться и выразить себя. Studio Pinhead с удовольствием превратит ваши идеи в реальность. Закажите у нас печать на футболках уже сегодня и наслаждайтесь уникальным стилем, качеством и комфортом!',
        },
      ],
    },
  ],
  main_text:
        'Создадим футболку с уникальным дизайном! PINHEAD STUDIO САНКТ-ПЕТЕРБУРГ предлагает заказать печать на футболках, худи, свитшотах и другой одежде любым методом от 1 штуки',
};
