import React, { useState, useEffect } from 'react';
import { Link, useHistory } from 'react-router-dom';
import { useSelector, useDispatch } from 'react-redux';
import { v4 as uuidv4 } from 'uuid';
import Button from '../../ui/Button/Button';
import SizeSelection from '../../components/size-selection/size-selection';
import styles from './zagitova-page.module.css';
import zgGallery from '../../components/images/friendsPage/zagitova/zagitova_gallery.png';
import zgRecomendCircle from '../../components/images/friendsPage/zagitova/zagitova_recomendation.svg';
import zgSale from '../../components/images/friendsPage/zagitova/zagitova_sale_bgi.png';
import isSizeFunction from '../../utils/isSizeFunction';
import addToMemory from '../../utils/addToMemory';
import { ADD_TO_CART } from '../../services/actions/cart-actions';
import { openPopup } from '../../services/actions/utility-actions';
import { closePopup } from '../../services/actions/utility-actions';
import PopupModel from '../../components/popupModel/popupModel';
import { addItemSize, deleteItemOrder } from '../../services/actions/item-action';
import Photos from '../../components/Photos/Photos';
import PhotosMobile from '../../components/PhotosMobile/PhotosMobile';

function ZagitovaPage() {
  const dispatch = useDispatch();
  const history = useHistory();
  const [size, setSize] = useState('');
  const { isOtherPopupVisible } = useSelector((store) => store.utilityState);
  const { order } = useSelector((store) => store.itemReducer);
  const {
    isBlockButton,
    isSelected,
    front_file,
    front_file_preview,
    back_file,
    back_file_preview,
    lsleeve_file,
    lsleeve_file_preview,
    rsleeve_file,
    rsleeve_file_preview,
    badge_file,
    activeView,
  } = useSelector((store) => store.editorState);
  const { products } = useSelector((store) => store.friendData);
  // console.log(products);
  const uuId = uuidv4();
  const closePopupConstructor = () => {
    dispatch(closePopup());
  };

  function getCurrentDimension() {
    return {
      width: window.innerWidth,
    };
  }

  const [screenWidth, setScreenWidth] = useState(getCurrentDimension());
  useEffect(() => {
    const updateDimension = () => {
      setScreenWidth(getCurrentDimension());
    };
    window.addEventListener('resize', updateDimension);
    return () => {
      window.removeEventListener('resize', updateDimension);
    };
  }, [screenWidth]);

  const addToCart = () => {
    if (isSizeFunction(order)) {
      const variant = 'безызбежно';
      // Создает обьект заказа, для сохранения в сесионой памяти
      const data = addToMemory(variant, order, products, uuId, front_file, front_file_preview, back_file, back_file_preview, lsleeve_file, lsleeve_file_preview, rsleeve_file, rsleeve_file_preview, badge_file);
      console.log(data);
      dispatch({
        type: ADD_TO_CART,
        payload: { ...data },
      });

      history.push('/cart');
    } else {
      dispatch(openPopup(['Нужно выбрать размер']));
    }
  };

  useEffect(() => {
    products?.sizes?.map((el, i) => {
      dispatch(
        addItemSize({
          name: el.name,
          qty: 0,
          _id: products._id + i,
        }),
      );
    });

    return () => {
      dispatch(deleteItemOrder());
    };
  }, [products]);

  return (
    <section className={styles.wrap}>
      <div className={styles.header}>
        <div className={styles.header_text}>
          <h2>
            алина <i>загитова</i>
          </h2>
          <h2>
            <i>alina</i> Zagitova
          </h2>
          <h2>
            алина <i>загитова</i>
          </h2>
          <h2>
            <i>alina</i> Zagitova
          </h2>
        </div>
      </div>
      <div className={styles.biography}>
        <div className={styles.biography_text}>
          <p>
            Алина Загитова родилась в 2002 году в Ижевске. С раннего детства она
            занималась фигурным катанием и уже тогда демонстрировала большие
            способности. В возрасте 13 лет она переехала в Москву для
            продолжения спортивной карьеры и стала тренироваться в Школе
            фигурного катания под руководством Этери Тутберидзе.
          </p>
          <p>
            Начиная с 2016 года, Загитова стала выступать на международных
            соревнованиях. Она завоевала серебряную медаль на Чемпионате мира
            среди юниоров 2017 года и выиграла этот турнир в следующем сезоне. В
            2018 году она стала серебряной призеркой взрослого Чемпионата Европы
            и завоевала золотую медаль на зимних Олимпийских играх, проходивших
            в Пхенчхане.
          </p>
          <p>
            После олимпийского золота Загитова продолжает активно участвовать в
            международных соревнованиях и занимать призовые места. В 2021 году
            она выиграла Чемпионат мира и стала двукратной чемпионкой России.
            Также она активно участвует в различных шоу и ледовых спектаклях,
            продолжая радовать своих поклонников своим талантом и мастерством.
          </p>
          <div className={styles.biography_textLink}>
            <Link
              to={{ pathname: 'https://instagram.com/azagitova' }}
              className={styles.social_link}
              target="blank"
            >
              / instagram
            </Link>
            <Link
              to={{ pathname: 'https://t.me/azagitova_official' }}
              className={styles.social_link}
              target="blank"
            >
              / TG
            </Link>
          </div>
        </div>
      </div>
      <div className={styles.gallery}>
        <img src={zgGallery} alt="Загитова фото" />
      </div>
      <div className={styles.memHistory}>
        <div className={styles.memHistory_wrap}>
          <h2>#безызбежно</h2>
          <p className={styles.memHistory_text}>
            В одном из своих последних интервью Алина Загитова допустила
            оговорку, которая вызвала множество обсуждений и забавных
            комментариев в социальных сетях. Отвечая на вопрос о своем отношении
            к хоккею, сказала: «Ну, конечно. Это безызбе…Безызбежно. Потому что
            у меня папа хоккеист в прошлом, сейчас тренер. Он следит,
            естественно, и на телевизорах у нас все время хоккей»
          </p>
          <p className={styles.memHistory_textDown}>
            Многие полезователи отреагировали на эту оговорку с юмором, однако
            было много и тех, кто комментировал в негативном ключе. В любом
            случае обычная оговорка получила слишком широкое обсуждение и
            история просто не могла не продолжиться, тем более что само слово за
            короткий период стало мемом. Так и случилось после того как Загитова
            выложила свои фотографии в футболке с хэштегом “БЕЗЫЗБЕЖНО”...
          </p>
          <Link
            to={{
              pathname:
                'https://ya.ru/search/?text=%D0%B0%D0%BB%D0%B8%D0%BD%D0%B0+%D0%B7%D0%B0%D0%B3%D0%B8%D1%82%D0%BE%D0%B2%D0%B0+%D0%B1%D0%B5%D0%B7%D1%8B%D0%B7%D0%B1%D0%B5%D0%B6%D0%BD%D0%BE&lr=2&search_source=yaru_desktop_common&search_domain=yaru&src=suggest_B',
            }}
            className={styles.social_link_mem}
            target="blank"
          >
            / сми
          </Link>
        </div>
      </div>
      <div className={styles.memImage} />
      <div className={styles.recommendation}>
        <div className={styles.recommendation_wrap}>
          <div className={styles.recommendation_top}>
            <img src={zgRecomendCircle} className={styles.avatar} alt="Фото Загитовой" />
            <p>
              “ Очень странно было читать такое большое количество реакций после этого интервью, а тем более видеть такое количество негатива из-за обычной оговорки. Мне захотелось напомнить всем, что ошибаться – это нормально и что меня не задевают комментарии. Я придумала кучу идей и футболка с надписью, как старейший способ заявить о своей позиции, понравилась мне больше всего, так что встречайте #безызбежно на текстиле, не нервничайте и будьте самими сабими :) “
            </p>
          </div>
          <div className={styles.recommendation_bottom}>
            <p>А.&nbsp;Загитова</p>
            <svg width="449" height="279" viewBox="0 0 449 279" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_259_13)">
                <g clip-path="url(#clip1_259_13)">
                  <path d="M501.743 103.793C500.115 103.58 499.34 103.345 498.15 103.547C493.031 103.681 487.654 103.737 482.456 104.13C476.742 104.365 471.207 104.938 465.673 105.51C460.396 106.16 455.378 106.89 450.102 107.54C439.213 109.021 428.065 110.424 417.097 112.163C410.295 113.195 403.773 115.158 397.149 116.527C391.121 117.795 385.25 118.547 379.48 119.893C370.657 122.002 361.833 124.112 352.931 126.479C345.04 128.308 337.406 130.215 329.694 132.38C318.334 135.41 307.232 138.518 296.052 141.884C294.783 142.344 293.773 142.882 292.505 143.342C289.373 144.363 286.061 145.048 283.188 146.147C277.261 148.01 271.435 150.467 265.508 152.329C260.434 154.169 255.259 155.415 250.185 157.255C241.901 160.374 233.539 163.751 225.255 166.87C215.107 170.55 204.96 174.23 194.812 177.911C187.46 180.749 180.186 183.33 172.833 186.168C165.818 188.828 159.162 192.16 152.146 194.819C117.146 207.857 84.5284 226.975 51.4273 243.974C48.3967 245.589 45.1079 247.127 41.7735 246.958C40.6621 246.902 39.3709 246.509 38.8316 245.5C38.2924 244.49 38.5279 243.716 38.8418 242.683C43.2476 225.415 54.3575 213.006 67.3763 201.741C70.7993 198.835 74.4806 196.007 78.4429 194.111C81.99 192.652 87.4005 190.633 91.0386 192.585C91.9931 193.158 93.0488 194.324 94.1603 194.381C95.0692 193.247 93.059 191.508 92.4413 190.756C89.1172 187.772 84.5144 188.063 80.6305 189.702C61.9077 198.386 43.5593 217.898 36.3026 237.118C35.024 240.394 34.0263 244.602 36.239 247.53C39.5302 252.479 45.2547 249.427 49.1385 247.789C55.8959 245.051 62.2938 241.64 68.6918 238.229C75.3479 234.897 81.8244 231.228 88.4805 227.896C95.1367 224.563 102.051 221.309 108.786 217.719C117.047 213.747 124.949 209.102 133.39 205.467C143.852 200.754 154.414 196.637 165.056 192.261C170.545 189.983 176.034 187.706 181.702 185.765C188.976 183.184 196.25 180.603 203.524 178.023C209.271 175.824 215.018 173.625 220.766 171.426C227.186 168.867 233.787 166.646 240.387 164.424C243.261 163.325 246.393 162.304 249.266 161.204C250.535 160.744 251.96 159.768 253.229 159.308C258.302 157.468 263.556 155.965 268.809 154.461C279.137 151.118 289.284 147.438 299.533 144.352C308.928 141.289 318.246 138.484 327.742 136.016C342.414 132.302 357.266 128.925 372.117 125.548C386.037 122.451 400.137 119.691 414.236 116.931C420.86 115.562 427.741 114.272 434.544 113.24C443.39 111.984 452.416 111.064 461.442 110.144C466.381 109.672 471.141 108.865 476.002 108.652C484.096 108.012 492.034 107.889 500.644 107.406C501.216 106.453 501.53 105.42 501.743 103.793Z" fill="#B9B9B9" />
                  <path d="M310.169 127.006C306.711 125.39 303.511 123.853 299.536 122.08C308.749 112.195 317.783 101.973 327.333 91.9089C327.311 91.0561 327.445 89.6872 327.68 88.913C326.984 88.4193 326.546 88.0042 326.288 87.9256C323.235 88.6886 320.26 89.1934 317.308 90.5511C307.52 94.9044 298.787 100.425 291.47 107.785C291.392 108.043 288.888 107 288.63 106.921C287.855 106.685 286.822 106.371 286.047 106.136C284.756 105.743 283.386 105.608 282.017 105.474C278.94 105.384 276.145 106.225 273.451 107.661C272.778 108.02 272.104 108.379 271.768 108.559C269.411 109.816 267.233 111.409 264.977 113.26C263.058 114.932 261.734 116.503 262.319 119.218C262.42 119.813 262.78 120.486 263.038 120.565C263.218 120.901 263.734 121.058 263.992 121.137C267.709 122.831 271.919 123.83 276.028 124.234C278.173 124.604 280.317 124.974 282.54 125.087C283.057 125.244 288.973 126.198 288.973 126.198C288.087 128.184 286.864 130.349 285.899 132.593C284.935 134.837 282.162 136.531 284.038 139.639C285.049 139.101 285.98 138.82 286.474 138.125C288.707 135.421 291.277 132.537 293.072 129.418C294.946 126.041 297.764 126.052 301.02 126.478C302.647 126.691 304.22 128.015 306.027 128.565C307.319 128.958 308.587 128.498 309.957 128.633C310.192 127.858 310.349 127.342 310.169 127.006ZM266.023 117.243C266.023 117.243 266.101 116.985 266.18 116.727C266.337 116.211 266.494 115.695 266.909 115.257C267.481 114.304 267.975 113.608 268.727 112.991C269.816 112.194 271.006 111.992 272.274 111.532C275.069 110.691 277.943 109.591 280.761 109.603C282.209 109.479 283.32 109.535 284.69 109.67C285.206 109.827 288.204 110.175 288.541 109.995C286.589 113.631 284.637 117.266 282.527 121.418C282.449 121.676 277.722 120.52 277.464 120.441C275.578 120.15 273.692 119.858 272.142 119.387C270.334 118.837 268.527 118.287 266.798 117.479C266.203 117.58 266.203 117.58 266.023 117.243ZM287.153 121.979C286.973 121.642 286.794 121.306 286.277 121.148C287.994 118.287 289.374 115.606 291.169 112.486C293.999 116.167 290.475 118.478 290.644 121.631C289.196 121.754 288.264 122.035 287.153 121.979ZM293.642 121.979C293.45 117.973 298.22 114.349 294.02 110.534C301.83 102.478 310.978 96.5202 321.642 92.9971C313.023 102.781 304.248 113.081 293.642 121.979Z" fill="#B9B9B9" />
                  <path d="M123.729 188.995C125.312 187.503 126.894 186.011 128.633 184.002C129.588 184.575 130.284 185.068 131.317 185.382C129.702 188.838 129.377 192.687 127.066 195.649C126.471 195.75 125.954 195.593 125.359 195.694C125.673 194.662 125.808 193.293 126.2 192.002C123.742 192.664 122.473 193.124 121.283 193.326C119.881 195.155 118.736 197.063 116.918 199.329C114.582 194.953 117.253 192.664 119.071 190.398C119.98 189.265 121.944 189.298 123.549 188.659C123.213 188.838 123.471 188.917 123.729 188.995Z" fill="#B9B9B9" />
                  <path d="M452.656 30.5019C450.882 27.9885 448.76 28.471 446.56 29.2115C444.955 29.851 443.349 30.4905 441.565 30.7935C431.865 32.0724 422.166 33.3514 412.545 34.3723C405.821 35.1464 398.995 35.3259 392.192 36.3581C381.224 38.097 370.178 40.0941 359.39 42.1697C353.103 43.359 346.84 45.401 340.396 47.1064C331.236 49.3952 322.155 51.426 313.253 53.7933C306.214 55.5997 299.356 57.7427 292.575 59.6276C284.785 62.0511 276.995 64.4745 269.463 66.9766C264.467 68.5586 259.809 69.961 254.735 71.8011C247.461 74.3817 240.109 77.2203 233.014 80.1375C221.183 84.7152 209.509 88.7768 197.779 93.9492C186.049 99.1216 174.6 105.225 163.23 111.071C160.536 112.507 157.505 114.123 154.812 115.559C151.781 117.175 148.93 119.127 146.079 121.079C143.307 122.773 140.793 124.546 138.2 126.577C137.033 127.632 135.866 128.686 134.699 129.741C134.283 130.179 131.949 132.288 133.992 132.064C136.81 132.075 139.527 131.492 142.243 130.908C167.03 125.478 191.254 118.185 216.04 112.755C217.567 112.373 219.094 111.992 220.8 111.947C223.102 111.801 225.403 111.655 227.446 111.431C227.704 111.509 227.704 111.509 228.041 111.33L227.963 111.588C227.704 111.509 227.626 111.767 227.368 111.689C226.279 112.486 225.112 113.54 224.102 114.079C219.803 116.155 214.987 118.073 210.688 120.149C205.042 122.943 199.497 126.331 193.851 129.125C185.848 133.175 177.924 136.968 169.999 140.76C166.632 142.555 163.523 144.429 160.414 146.303C157.226 148.434 154.038 150.566 150.514 152.878C147.582 148.603 144.048 153.73 140.511 152.373C140.802 150.488 141.015 148.861 141.486 147.312L139.577 146.168C134.751 150.903 130.262 155.458 125.515 159.935C125.143 155.593 128.903 152.507 127.06 147.435C122.728 151.475 119.069 155.155 115.904 158.139C115.882 157.287 115.499 155.761 115.375 154.313C115.117 154.235 114.522 154.336 114.264 154.257C109.461 159.845 105.119 166.7 99.0017 171.043C93.0645 175.721 85.7906 178.302 78.5725 179.772C73.4759 180.759 68.0199 181.073 62.7209 180.871C59.3865 180.703 55.8724 180.198 52.9305 178.739C48.0797 176.136 44.7885 171.188 43.5405 166.015C42.0114 159.911 41.6496 152.753 42.6802 146.582C46.8482 123.602 54.9455 100.691 66.6025 79.9893C76.6213 61.8911 90.02 45.6667 106.429 33.4592C112.624 28.8589 119.516 24.7524 127.149 22.8451C134.783 20.9377 143.259 21.8242 149.604 26.0095C156.128 30.5314 160.004 38.1949 159.872 46.0491C159.74 53.9034 156.094 61.2526 152.347 68.0072C137.907 93.219 118.853 115.054 96.271 132.714C99.4005 125.208 102.014 117.544 103.852 109.645C104.3 107.244 105.006 104.921 104.343 102.464C103.579 99.4122 100.277 97.2803 97.2012 97.1905C107.324 86.1723 117.525 74.896 127.389 63.7992C130.71 60.2985 134.189 56.2817 135.086 51.4794C135.478 50.1891 135.511 48.2255 134.04 47.4962C132.906 46.5873 131.043 47.1483 129.696 47.8664C116.047 54.7106 103.835 64.2477 93.8928 75.6025C94.8472 76.1748 95.8017 76.747 96.4979 77.2407C106.104 66.0654 118.495 56.8649 131.908 50.7949C121.406 66.7725 108.815 81.269 94.3708 93.5102C87.1094 99.7598 79.1518 105.516 74.6754 113.74C80.8708 109.14 87.4257 105.213 94.1604 101.622C96.1023 100.803 98.6392 99.8833 99.8746 101.387C100.751 102.217 100.616 103.586 100.561 104.697C100.049 117.51 94.2381 130.122 85.0803 138.896C82.2522 141.701 78.6494 144.271 74.9226 145.393C70.9375 146.436 66.4917 146.212 63.2688 143.822C62.3143 143.249 61.6966 142.498 60.6636 142.183C59.6307 141.869 58.3622 142.329 58.0483 143.362C58.071 144.214 58.509 144.629 58.8685 145.303C61.1597 147.973 63.6306 150.98 67.0663 151.743C71.5348 152.82 75.9909 150.229 79.8519 147.738C109.809 128.091 135.834 101.892 153.448 70.8796C159.563 60.0521 164.599 47.2049 160.194 35.7152C157.913 30.2285 153.948 25.6393 149.075 22.1834C145.594 19.7149 141.439 17.6054 137.33 17.2014C131.851 16.6627 126.519 18.4242 121.367 20.5224C105.675 27.591 92.3975 38.7774 81.3104 52.0397C71.2563 65.6161 62.5161 80.438 55.2469 95.9893C46.1826 114.66 38.298 135.945 38.9455 157.005C39.3301 165.016 41.7807 173.656 47.8112 178.874C53.1456 183.597 60.5333 185.281 67.4375 184.843C75.7114 184.54 84.8715 182.252 92.2011 178.56C96.8369 176.305 101.371 173.455 104.951 170.033C107.364 167.665 109.17 161.73 113.841 163.996C116.747 160.933 119.575 158.128 121.988 155.761C122.057 158.319 122.046 161.135 121.801 164.726C123.664 164.165 125.112 164.041 125.527 163.604C129.108 160.182 132.429 156.681 136.009 153.259C136.088 153.001 136.604 153.158 136.941 152.978C137.222 153.91 137.582 154.583 138.042 155.851C140.602 155.784 143.498 155.537 146.653 155.368C148.304 156.434 150.863 156.367 154.051 154.235C159.001 150.948 163.95 147.66 169.08 144.71C180.529 138.606 191.978 132.502 203.606 126.735C212.204 122.584 220.982 118.769 229.76 114.954C233.644 113.316 234.193 111.51 231.082 106.898C227.332 107.167 223.145 107.021 218.98 107.728C207.855 109.983 196.495 113.012 185.393 116.12C172.169 119.711 159.181 122.527 145.598 125.444C145.418 125.107 145.239 124.771 145.137 124.176C153.297 119.609 161.458 115.043 169.539 110.734C173.58 108.58 177.542 106.684 181.841 104.608C188.419 101.534 194.817 98.1231 201.574 95.3855C209.342 92.1092 217.289 89.1696 224.978 86.1515C229.457 84.4124 234.014 82.4152 238.752 80.7547C243.23 79.0156 247.81 77.8712 252.547 76.2107C260.158 73.4506 267.847 70.4324 275.716 67.7509C287.907 63.8464 300.277 60.2785 312.648 56.7106C321.033 54.1861 329.52 52.2564 338.264 50.4051C348.536 48.1724 358.729 46.1978 368.922 44.2232C379.115 42.2485 389.23 40.532 399.602 38.8939C409.638 37.4354 419.596 36.235 429.554 35.0346C435.088 34.4624 440.802 34.2269 446.415 33.3967C448.638 33.5089 451.894 33.9353 452.656 30.5019Z" fill="#B9B9B9" />
                  <path d="M90.4781 40.4491C89.0859 39.4619 87.5266 41.8064 88.9972 42.5356C90.3894 43.5228 91.9487 41.1783 90.4781 40.4491Z" fill="white" />
                </g>
              </g>
              <defs>
                <clipPath id="clip0_259_13">
                  <rect width="449" height="279" fill="white" />
                </clipPath>
                <clipPath id="clip1_259_13">
                  <rect width="432.414" height="331.24" fill="white" transform="translate(104.862 -76.4102) rotate(16.9176)" />
                </clipPath>
              </defs>
            </svg>
          </div>
        </div>
      </div>
      <section className={styles.section_photos}>
        {screenWidth.width > 1250 ? <Photos {...products} /> : <PhotosMobile {...products} />}
        <div className={styles.product_box}>
          <div className={styles.description}>
            <div className={styles.title_box}>
              <h1 className={styles.title}>Футболка #БЕЗЫЗБЕЖНО</h1>
              <p className={styles.text}>&#8213; {products?.price} Р.</p>
            </div>
            <p className={styles.text}>
              {products?.description}
            </p>
            <ul className={styles.box_link}>
              <li className={styles.menu_elem}>
                <Link
                  to="/size_chart"
                  className={styles.menu_link}
                  target="blank"
                >
                  Гид по размерам
                </Link>
              </li>
              <span>/</span>
              <li className={styles.menu_elem}>
                <Link to="/shop" className={styles.menu_link} target="blank">
                  Гид по уходу
                </Link>
              </li>
            </ul>
            <label className={styles.select_label} htmfor="sizeSelect">
              Выберите размер:
            </label>
            {order.length > 0 ? (order.map((item, index) => (
              <span className={styles.selectionTest} key={index}>
                <SizeSelection
                  name={item.name}
                  type="shop"
                  qty={item.qty}
                  size={size}
                  id={item._id}
                  key={index}
                  remain={products.sizes[index].qty}
                />
              </span>
            ))) : <p>Нет в наличии</p>}
            <Button className={styles.button_down} onClickTo={addToCart}>В корзину &gt;</Button>
          </div>
        </div>
      </section>

      <div className={styles.footer}>
        <ul className={styles.footer_links}>
          <li>
            <Link to="/" className={styles.menu_link_footer}>
              Студия
            </Link>
          </li>
          <li>
            <Link
              to={{ pathname: 'https://pnhd.ru' }}
              className={styles.menu_link_footer}
              target="blank"
            >
              Оптовый отдел
            </Link>
          </li>
          <li>
            <Link to="/shop" className={styles.menu_link_footer}>
              Каталог
            </Link>
          </li>
          <li>
            <Link to="/#contacts" className={styles.menu_link_footer}>
              Контакты
            </Link>
          </li>
          <li>
            <Link to="/oferta" className={styles.menu_link_footer}>
              Оферта
            </Link>
          </li>
          <li>
            <Link
              to="/size_chart"
              className={styles.menu_link_footer}
              target="blank"
            >
              Гид по размерам
            </Link>
          </li>
        </ul>
        <span className={styles.footer_companyInfo}>
          <p>ООО “ПИНХЭД СТУДИО”</p>
          <p>ИНН: 7810463916</p>
          <p>ОГРН: 1137847215440</p>
        </span>
        <p className={styles.footer_merch}>MERCH AGAINST THE MACHINES!</p>
      </div>
      {isOtherPopupVisible && (
      <PopupModel onClose={closePopupConstructor}>
        {isOtherPopupVisible.map((el, index) => (
          <p className={styles.instruction} key={index}>
            {el}
          </p>
        ))}
      </PopupModel>
      )}
    </section>
  );
}

export default ZagitovaPage;
