import silkMain from "../../../public/printingMethods/silk/main.webp";
import termoMain from "../../../public/printingMethods/termo/main.webp";
import silk1 from "../../../public/printingMethods/silk/1.webp";
import silk2 from "../../../public/printingMethods/silk/2.webp";
import silk3 from "../../../public/printingMethods/silk/3.webp";
import silk4 from "../../../public/printingMethods/silk/4.webp";
import silk5 from "../../../public/printingMethods/silk/5.webp";
import silk6 from "../../../public/printingMethods/silk/6.webp";

export const ssOptions = [
    {
        slug: 'shelkografiya',
        type: 'pechat-logotipa-shelkografiej',
        title: 'ШЕЛКОГРАФИЯ >',
        subtitle: 'ПЕЧАТЬ ЛОГОТИПА',
        mainText: 'Общей чертой для большинства логотипов можно назвать лаконичность, которая выражается, в том числе, и в цветовой схеме. Обычно логотип это 1-2-3х цветное изображение или надпись. При этом сами цвета обычно плашечные, т.е. однотонные, а для того небольшого процента лого, которые используют градиенты и прочие сложные цветовые схемы дизайнеры обычно предусматривают монохромные версии как раз на такой случай.  Шелкография отлично подходит для таких задач. Она сможет точно передать фирменные цвета логотипа, а если лого монохромное, то белый будет ярким и контрастным. Однако шелкография – это сложный технический процесс, поэтому для того чтобы получить результат придется подождать и, порой, довольно значительное время.',
        pros: '> Долговечно,> Низкая стоимость,> Можно печатать по PANTONE,> Яркие цвета в т.ч. белый',
        cons: '> Тираж от 50 штук,> Срок от 3х недель',
        summaryText: '',
        robotsText: {__html: `<h1>Печать+логотипа+шелкографией</h1>
        <p>Pinhead+Studio+предлагает+услуги+профессиональной+печати+логотипов+шелкографией+в+Санкт-Петербурге.+Мы+обеспечиваем+высокое+качество+нанесения,+долговечность+и+яркость+логотипов+на+любых+тканях.</p>
        <h2>Преимущества+шелкографии+для+нанесения+логотипа</h2>
        <p>Шелкография+—+это+не+только+традиционный,+но+и+один+из+наиболее+надежных+методов+печати.+</p>
        <ul>
        <li>
        Высокая+точность+деталей:+идеально+подходит+для+сложных+и+многоцветных+логотипов.
        </li>
        <li>
        Износостойкость:+изображения+не+теряют+цвет+и+форму+после+многократных+стирок.
        </li>
        <li>
        Универсальность:+подходит+для+различных+видов+тканей,+от+хлопка+до+синтетики.
        </li>
        <li>
        Экологичность:+используемые+краски+безопасны+для+окружающей+среды+и+человека.
        </li>
        </ul>
        <h3>Как+мы+работаем</h3>
        <p>Мы+поможем+вам+выбрать+оптимальный+вариант+печати,+подготовим+макет+и+предложим+пробный+оттиск+перед+запуском+в+производство.+Наша+цель+—+ваше+полное+удовлетворение+качеством+конечного+продукта.Заказывая+нанесение+логотипа+шелкографией+в+Pinhead+Studio,+вы+получаете+не+только+печать,+но+и+полную+поддержку+на+всех+этапах+—+от+дизайна+до+доставки+готовой+продукции.</p>
        `},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать логотипа шелкографией в Санкт-Петербурге нанесение от 24 часов в Pinhead Studio',
            metaDescription: 'Заказать печать логотипа шелкографией в Санкт-Петербурге. Нанесение логотипов шелкографией на любую одежду от 1 шт в Pinhead Studio.',
            metaKeywords: 'шелкография нанесение логотипа, санкт-петербург',
        }
    },
    {
        slug: 'termotransfernaya-pechat',
        type: 'termotransfernaya-pechat-na-futbolkah',
        title: 'ТЕРМОТРАНСФЕР >',
        subtitle: 'ПЕЧАТЬ ФУТБОЛОК',
        mainText: 'Каким методом напечатать на футболке? В наших студиях или при заказе на сайте мы оцениваем множество параметров задачи по печати чтобы предложить наиболее оптимальный метод нанесения в каждой конкретной ситуации. Вот самые базовые: сроки и количество футболок, которые нужно запечатать, состав ткани футболки и само изображение. Термотрансфер для печати футболок отлично подойдет, если напечатать нужно супер срочно и это не очень большое количество – срок выполнения этого метода один из самых быстрых. Состав ткани здесь не играет роли – термотрансфер можно перенести на все что угодно, а вот изображение и исходный файл имеет значение: для этого метода печати подойдут только векторные файлы с одноцветным изображением и элементами изображения не менее 5мм. Кроме всего этого мы предложим термотрансфер если нужно напечатать золотой/медный/кислотный принт или принт с другими спецэффектами.',
        pros: '> Любой метриал,> Средняя стоимость,> От 15 минут,> Есть спецэффекты,> Тираж от 1 штуки',
        cons: '> Требователен к условиям стирки,> Только векторные файлы,> Одноцветные изображения',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Термотрансферная печать на футболках в Санкт-Петербурге заказать в Pinhead Studio',
            metaDescription: 'Термотрансферная печать на футболках в Санкт-Петербурге. Изготовление футболок с термотрансферной печатью от 1 шт. в Pinhead Studio.',
            metaKeywords: 'термотрансфер на футболку, термотрансферная печать',
        }
    },
    {
        slug: 'termotransfernaya-pechat',
        type: 'termotransfernaya-pechat-na-tolstovkah',
        title: 'ТЕРМОТРАНСФЕР >',
        subtitle: 'ПЕЧАТЬ ТОЛСТОВОК',
        mainText: 'Каким методом напечатать на толстовке? В наших студиях или при заказе на сайте мы оцениваем множество параметров задачи по печати чтобы предложить наиболее оптимальный метод нанесения в каждой конкретной ситуации. Вот самые базовые: сроки и количество толстовок, которые нужно запечатать, состав ткани толстовки и само изображение. Термотрансфер для печати толстовок отлично подойдет, если напечатать нужно супер срочно и это не очень большое количество – срок выполнения этого метода один из самых быстрых. Состав ткани здесь не играет роли – термотрансфер можно перенести на все что угодно, а вот изображение и исходный файл имеет значение: для этого метода печати подойдут только векторные файлы с одноцветным изображением и элементами изображения не менее 5мм. Кроме всего этого мы предложим термотрансфер если нужно напечатать золотой/медный/кислотный принт или принт с другими спецэффектами.',
        pros: '> Любой метриал,> Средняя стоимость,> От 15 минут,> Есть спецэффекты,> Тираж от 1 штуки',
        cons: '> Требователен к условиям стирки,> Только векторные файлы,> Одноцветные изображения',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Термотрансферная печать на толстовках в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Заказать термотрансферную печать на толстовках в Санкт-Петербурге. Изготовление толстовок с термотрансферной печатью от 24 часов в Pinhead Studio.',
            metaKeywords: 'термотрансферная печать на толстовках',
        }
    },
    {
        slug: 'dtf-pechat',
        type: 'dtf-pechat-logotipa',
        title: 'DTF >',
        subtitle: 'ПЕЧАТЬ ЛОГОТИПОВ',
        mainText: 'Логотип – вещь довольно лаконичная. Обычно логотип это 1-2-3х цветное изображение или надпись. При этом сами цвета обычно плашечные, т.е. однотонные, а для того небольшого процента лого, которые используют градиенты и прочие сложные цветовые схемы дизайнеры обычно предусматривают монохромные версии как раз на такой случай.  Однако, если монохромной версии нет, а в логотипе есть сложные градиенты, фото и при этом небольшой тираж, то это задача для ДТФ. Полноцветная печать с переносом на любой текстиль, минимальный тираж от 1 штуки – все это про ДТФ. Особенно хорошо подойдет для печати на черных/цветных тканях. К тому же мы рекомендуем ДТФ как в целом универсальный метод печати.',
        pros: '> Любой метриал,> Полноцветная печать,> Тираж от 1 штуки',
        cons: '> Требователен к условиям стирки,> 1-2 дня срок печати',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTF печать логотипов в Санкт-Петербурге заказать в Pinhead Studio',
            metaDescription: 'Профессиональная DTF печать логотипов в Санкт-Петербурге. Печать логотипов дтф на любой одежде в Pinhead Studio.',
            metaKeywords: 'логотип дтф печатью, dtf логотип',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-futbolkah',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ФУТБОЛОК',
        mainText: 'DTG для печати футболок может быть как отличным решением, так и проблемой. Стоит сразу сказать что прямую печать или DTG можно делать только на футболках с более чем 50% хлопка в составе. Но даже если требования по составу учтены мы все же не рекомендуем выполнять этот метод на чем-то кроме белых футболок.  На белом текстиле все печатается легко и просто. Можно выполнить принт даже менее чем за 15 минут, он не будет ощущаться тактильно и вообще со всех сторон одни плюсы…На цветном текстиле процесс несколько сложнее, поэтому вероятность брака повышается, а также возможны довольно большие отличия в цветопередаче принта относительно изображения на мониторе, но при этом принт приобретает некоторый «винтажный» эффект, что может стать крутым инструментом для кастомизации.',
        pros: '> Супер быстрая печать,> Полноцветная печать,> Тираж от 1 штуки',
        cons: '> Требователен к условиям стирки,> Тяжело печатать цветной текстиль',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на футболках в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Заказать DTG печать на футболках в Санкт-Петербурге. Полноцветная ДТГ печать на футболках от 1 шт. в Pinhead Studio.',
            metaKeywords: 'dtg печать на футболках, дтг печать на футболках',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-tolstovkah',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ТОЛСТОВОК',
        mainText: 'Вот сейчас получится действительно кратко: мы крайне не советуем выполнять DTG печать на толстовках….ну разве что на белых, но и тут мы 10 раз переспросим. Выбирать этот метод для толстовок можно только если действительно нужно оооочень быстро, а итоговый результат заботит мало. Мы бы посоветовали посмотреть в сторону любого другого метода – изображение будет выглядеть значительно лучше. ',
        pros: '> Скорость печати',
        cons: '> Все остальное',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на толстовках в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Печать на толстовках DTG методом в Санкт-Петербурге. Толстовки с ДТГ печатью от 1 шт. в Pinhead Studio.',
            metaKeywords: 'dtg печать на толстовках, дтг на толстовках',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-hudi',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ХУДИ',
        mainText: 'Вот сейчас получится действительно кратко: мы крайне не советуем выполнять DTG печать на худи….ну разве что на белых, но и тут мы 10 раз переспросим. Выбирать этот метод для худи можно только если действительно нужно оооочень быстро, а итоговый результат заботит мало. Мы бы посоветовали посмотреть в сторону любого другого метода – изображение будет выглядеть значительно лучше. ',
        pros: '> Скорость печати',
        cons: '> Все остальное',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на худи в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Заказать DTG печать на худи в Санкт-Петербурге в Pinhead Studio. ДТГ печать на худи от 1 шт. Изготовление от 24 часов.',
            metaKeywords: 'dtg печать на худи, дтг на худи',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-hudi',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ХУДИ',
        mainText: 'Вот сейчас получится действительно кратко: мы крайне не советуем выполнять DTG печать на худи….ну разве что на белых, но и тут мы 10 раз переспросим. Выбирать этот метод для худи можно только если действительно нужно оооочень быстро, а итоговый результат заботит мало. Мы бы посоветовали посмотреть в сторону любого другого метода – изображение будет выглядеть значительно лучше. ',
        pros: '> Скорость печати',
        cons: '> Все остальное',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на худи в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Заказать DTG печать на худи в Санкт-Петербурге в Pinhead Studio. ДТГ печать на худи от 1 шт. Изготовление от 24 часов.',
            metaKeywords: 'dtg печать на худи, дтг на худи',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-svitshotah',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ СВИТШОТОВ',
        mainText: 'DTG печать на свитшотах мы посоветуем при срочных задачах для белых/светлых цветов ткани. На остальных цветах принт приобретает некоторый «винтажный» эффект и это не всегда то, что необходимо. В любом случае мы советуем заказать тест-пресс именно вашего принта для того чтобы оценить как именно он будет выглядеть.',
        pros: '> Скорость печати,> Винтажный эффект,> От 1 штуки,> Тактильность',
        cons: '> Не для всех задач,> Тяжело выполнять на "клиентском" текстиле',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на свитшотах в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'DTG печать на свитшотах с индивидуальным дизайном в Санкт-Петербурге в Pinhead Studio. Изготовление свитшотов с ДТГ печатью от 1 шт.',
            metaKeywords: 'dtg печать на свитшотах, дтг на свитшотах',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-na-shopperah',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ШОППЕРОВ',
        mainText: 'Выбор этого метода для шопперов будет зависеть от характера принта и его расположения на шоппере. Также мы сможем выполнить его только на 100% хлопке. В любом случае здесь нет каких-то общих рекомендаций – лучше рассказать о задаче нашим специалистам – они подскажут что будет лучше в каждом конкретном случае.',
        pros: '> Скорость печати,> Винтажный эффект,> От 1 штуки,> Тактильность',
        cons: '> Не для всех задач,> Тяжело выполнять на "клиентском" текстиле',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать на шопперах в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Уникальные шопперы с DTG печатью в Санкт-Петербурге. DTG печать на шопперах от 1 шт. в Pinhead Studio.',
            metaKeywords: 'dtg печать на шопперах, дтг на шопперах',
        }
    },
    {
        slug: 'pryamaya-dtg-pechat',
        type: 'dtg-pechat-logotipa',
        title: 'DTG >',
        subtitle: 'ПЕЧАТЬ ЛОГОТИПОВ',
        mainText: 'Печать логотипа методом ДТГ отлично подойдет  для белого/светлого текстиля и для логотипов с большим количеством градиентов/фото. Также это хороший вариант при малых тиражах. В остальных случаях (если нет каких-то специальных условия) мы бы рекомендовали выбрать ДТФ или термотрансфер, а для тиражей от 50 штук отлично подойдет шелкография.',
        pros: '> Скорость печати,> От 1 штуки,> Тактильность',
        cons: '> Не для всех задач,> Тяжело выполнять на "клиентском" текстиле',
        summaryText: '',
        robotsText: {__html: ``},
        cover: termoMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'DTG печать логотипов в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'DTG печать логотипа на любой одежде в Pinhead Studio. Изготовление одежды с дтг логотипом от 24 часов.',
            metaKeywords: 'dtg печать логотипа, дтг логотип',
        }
    },
]