import { TOptionsData } from "./types";
import silkMain from "../../../public/printingMethods/silk/main.webp";
import termoMain from "../../../public/printingMethods/termo/main.webp";
import silk1 from "../../../public/printingMethods/silk/1.webp";
import silk2 from "../../../public/printingMethods/silk/2.webp";
import silk3 from "../../../public/printingMethods/silk/3.webp";
import silk4 from "../../../public/printingMethods/silk/4.webp";
import silk5 from "../../../public/printingMethods/silk/5.webp";
import silk6 from "../../../public/printingMethods/silk/6.webp";



export const printsOptions: Array<TOptionsData> = [
    {
        slug: 'pechat-printov',
        title: 'PRINTS >',
        subtitle: 'Печать принтов',
        mainText: '',
        robotsText: {__html: `<h1>Печать+принтов+на+одежде+в+Санкт-Петербурге</h1>
<p>Нанесение+принта+на+одежду+в+Санкт-Петербурге+от+Pinhead+Studio+—+это+возможность+создать+уникальные+и+качественные+изделия+с+индивидуальным+дизайном.+Мы+предлагаем+печать+на+заказ,+гарантируя+долговечность+и+яркость+каждого+принта.+Закажите+печать+у+нас+и+получите+стильную+и+оригинальную+одежду.</p>
<h2>Преимущества+нашей+печати</h2>
<p>Pinhead+Studio+обеспечивает+высокое+качество+и+оперативное+выполнение+заказов.</p> 
<ul>
<li><strong>Индивидуальный+подход:</strong>+каждый+заказ+разрабатывается+с+учетом+ваших+пожеланий+и+требований.</li>
<li><strong>Современные+технологии:</strong>+используем+передовые+методы+печати+для+достижения+наилучших+результатов.</li>
<li><strong>Высокое+качество:</strong>+гарантируем+долговечность+и+яркость+каждого+принта.</li>
<li><strong>Быстрое+выполнение+заказов:</strong>+минимальные+сроки+изготовления+без+потери+качества.</li>
<li><strong>Гибкость:</strong>+Принимаем+заказы+любого+объема,+от+одного+изделия+до+крупной+партии.</li> 
</ul> 
<h3>Как+сделать+заказ</h3>
<p>Процесс+заказа+печати+принтов+в+Pinhead+Studio+прост+и+удобен.+Свяжитесь+с+нами,+обсудите+ваш+проект+с+нашими+специалистами,+предоставьте+свой+макет+или+закажите+создание+уникального+дизайна+у+наших+дизайнеров.+Мы+предоставим+пробный+оттиск+для+финального+согласования+перед+печатью.+Ваш+заказ+будет+выполнен+в+кратчайшие+сроки+и+доставлен+по+указанному+адресу.</p> 
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать принтов на одежде в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Нанесение принта на одежду в Санкт-Петербурге на заказ. Заказать печать принтов на одежде в Pinhead Studio.',
            metaKeywords: 'нанесение принта на одежду спб, печать, на заказ, заказать',
        }
    }, //печать принтов
    {
        slug: 'pechat-logotipov',
        title: 'PRINTS >',
        subtitle: 'Печать логотипов',
        mainText: 'Логоти́п — графический знак, эмблема или символ, используемый для повышения узнаваемости в социуме говорит нам википедия. Как правило, логотип – монохромная или двух-трехцветная графика со строго определенными цветами. Какой метод печати подойдет лучше? Наиболее подходящим методом печати здесь является шелкография – можно напечатать на чем угодно, точно подобрать требуемые цвета. Это долговечно, не дорого, но только на тиражи от 50 штук. Что делать если нужно забрендировать буквально пару штук? В этом случае отлично подойдет термоперенос или дтф-печать – минимальное количество не ограничено, печать от 15 минут. Могут быть небольшие расхождения с оригинальной цветовой схемой логотипа (если он не монохромный), но мы считаем что в такой задаче это разумный компромисс.  ',
        robotsText: {__html: `<h1>Печать логотипов+в+Санкт-Петербурге!</h1>
<p>Ищете+способ+сделать+свою+фирменную+одежду+узнаваемой?+<strong>Pinhead+Studio</strong>+предлагает+услуги+<strong>профессиональной+печати+логотипов+на+одежде+в+Санкт-Петербурге</strong></p>
<h2>Почему+стоит+выбрать+Pinhead+Studio?</h2> <p>Pinhead+Studio+обеспечивает+качественные+услуги+по+нанесению+логотипов+на+одежду.</p> 
<ul> 
<li><strong>Качественная+печать.</strong>+Мы+используем+<strong>современное+оборудование</strong>+и+<strong>высококачественные+материалы</strong>,+чтобы+ваш+логотип+был+<strong>ярким,+чётким+и+долговечным</strong>.</li> 
<li><strong>Срочная+печать.</strong>+Вам+нужен+логотип+<strong>сегодня+же?</strong>+Никаких+проблем!+Мы+можем+изготовить+заказ+<strong>в+кратчайшие+сроки</strong>.</li> 
<li><strong>Доступные+цены.</strong>+Мы+предлагаем+<strong>выгодные+цены</strong>+на+печать+логотипов+на+одежде+<strong>любых+тиражей</strong>.</li> 
<li><strong>Индивидуальный+подход.</strong>+Мы+внимательно+<strong>выслушаем+все+ваши+пожелания</strong>+и+<strong>поможем+с+выбором+оптимального+варианта+печати</strong>.</li>
<li><strong>Широкий+спектр+услуг.</strong>+Помимо+печати+логотипов,+мы+также+предлагаем+<strong>разработку+дизайна</strong>,+<strong>вышивку</strong>+и+<strong>другие+услуги</strong>.</li>
<li><strong>Удобный+сервис.</strong>+Вы+можете+<strong>заказать+печать+логотипа+онлайн</strong>+или+<strong>в+нашей+студии</strong>.</li> 
</ul> 
<h3>Заказывайте+нанесение+логотипа+на+одежду+в+Санкт-Петербурге+в+Pinhead+Studio</h3>
<p>Мы+гарантируем+высокое+качество,+оперативное+выполнение+заказов+и+профессиональный+подход+к+каждому+проекту.+Обратитесь+к+нам+сегодня,+чтобы+создать+уникальные+изделия+с+вашим+логотипом!</p>
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать логотипа на одежде в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Нанесение логотипа на одежду в Санкт-Петербурге. Срочная печать логотипов в Pinhead Studio.',
            metaKeywords: 'нанесение логотипа на одежду спб, печать, срочно',
        }
    }, // печать лого
    {
        slug: 'pechat-nadpisej',
        title: 'PRINTS >',
        subtitle: 'Печать надписей',
        mainText: 'Что выбрать для печати надписей? Задача похожа на печать логотипов из-за схожести типов графики, так что методы печати будут теми же: шелкография для больших тиражей и термоперенос/дтф для штучных или срочных заказов.',
        robotsText: {__html: `<h1>Печать+надписей+на+одежде+на+заказ+в+Санкт-Петербурге</h1>
<p>Pinhead+Studio+предлагает+услуги+срочной+печати+надписей+на+одежде+на+заказ+в+Санкт-Петербурге.+Мы+обеспечиваем+высокое+качество+нанесения,+долговечность+и+яркость+надписей+на+любых+тканях,+что+делает+нашу+продукцию+идеальным+выбором+для+различных+нужд.</p>
<h2>Преимущества+нанесения+надписей+в+Pinhead+Studio</h2>
<p>Печать+надписей+на+одежде+—+это+эффективный+способ+выделиться+и+подчеркнуть+индивидуальность.</p> 
<ul> 
<li>Высокая+точность+деталей:+идеально+подходит+для+сложных+и+многоцветных+надписей. </li> 
<li>Износостойкость:+надписи+не+теряют+цвет+и+форму+после+многократных+стирок. </li> 
<li>Универсальность:+подходит+для+различных+видов+тканей,+от+хлопка+до+синтетики. </li> 
<li>Экологичность:+используемые+краски+безопасны+для+окружающей+среды+и+человека. </li> 
</ul> 
<h3>Как+мы+работаем</h3>
<p>Мы+поможем+вам+выбрать+оптимальный+вариант+печати,+подготовим+макет+и+предложим+пробный+оттиск+перед+запуском+в+производство.+Наша+цель+—+ваше+полное+удовлетворение+качеством+конечного+продукта.+Заказывая+печать+надписей+на+одежде+на+заказ+в+Pinhead+Studio,+вы+получаете+не+только+качественное+нанесение,+но+и+полную+поддержку+на+всех+этапах+—+от+дизайна+до+доставки+готовой+продукции.+Срочная+печать+надписей+на+одежде+в+Санкт-Петербурге+от+Pinhead+Studio+—+это+гарантия+качества+и+оперативности.+Заказывайте+у+нас+и+убедитесь+в+этом+сами!</p>
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать надписей на одежде в Санкт-Петербурге на заказ в Pinhead Studio',
            metaDescription: 'Печать надписей на одежде в Санкт-Петербурге. Заказать нанесение надписей на одежду в Pinhead Studio.',
            metaKeywords: 'надпись на одежде на заказ, спб, нанесение',
        }
    }, //печать надписей
    {
        slug: 'pechat-risunkov',
        title: 'PRINTS >',
        subtitle: 'Печать рисунков',
        mainText: 'Под рисунками мы обычно имеем ввиду какие-либо полноцветные изображения в т.ч. всякие фотографии, картинки из интернета и прочее. Для таких задач отлично подойдут два метода печати: прямая печать или дтф, причем мы бы советовали скорее второй из-за большей предсказуемости технологии, но и прямая печать – хороший вариант, особенно когда нужно очень быстро.',
        robotsText: {__html: `<h1>Печать+рисунков+на+одежде+в+Санкт-Петербурге</h1>
<p>Pinhead+Studio+предлагает+услуги+срочной+печати+рисунков+на+одежде+в+Санкт-Петербурге.+Мы+гарантируем+высокое+качество+нанесения,+долговечность+и+яркость+изображений+на+любых+тканях.+Наши+услуги+идеально+подходят+для+тех,+кто+хочет+создать+уникальный+дизайн+на+своей+одежде.</p> 
<h2>Преимущества+печати+рисунков+в+Pinhead+Studio</h2>
<p>Печать+рисунков+на+одежде+позволяет+выразить+свою+индивидуальность+и+выделить+свой+бренд.</p> 
<ul>
<li>Высокая+точность+передачи+деталей:+идеально+подходит+для+сложных+и+многоцветных+изображений.</li>
<li>Износостойкость:+рисунки+сохраняют+цвет+и+форму+после+многократных+стирок.</li>
<li>Универсальность:+подходит+для+различных+видов+тканей,+включая+хлопок+и+синтетику.</li>
<li>Экологичность:+используемые+краски+безопасны+для+окружающей+среды+и+человека.</li> 
</ul> 
<h3>Этапы+нашей+работы</h3>
<p>Мы+поможем+выбрать+оптимальный+вариант+печати,+подготовим+макет+и+предложим+пробный+оттиск+перед+производством.+Заказывая+печать+рисунков+на+одежде+в+Pinhead+Studio,+вы+получаете+не+только+качественное+нанесение,+но+и+поддержку+на+всех+этапах+—+от+дизайна+до+доставки+готовой+продукции.+Срочная+печать+рисунков+на+одежде+в+Санкт-Петербурге+от+Pinhead+Studio+—+это+гарантия+качества+и+оперативности.+Заказывайте+у+нас+и+убедитесь+в+этом+сами!</p>
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать рисунков на одежде в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Печать рисунков на одежде в Санкт-Петербурге. Заказать нанесение рисунков на одежду в Pinhead Studio.',
            metaKeywords: 'печать рисунков на одежде, спб',
        }
    }, //печать рисунков 
    {
        slug: 'srochnaya-pechat-na-futbolkah',
        title: 'PRINTS >',
        subtitle: '',
        mainText: 'Иногда мерч нужен оооочень срочно….Для таких омментов отлично подойдет прямая печать или термоперенос – в зависимости от того, что именно нужно напечатать и на чем. В этом случае задачу по печати можно уложить в 15 минут (если печатать на белом текстиле), а на цветном/черном сократить до 1-2х часов.',
        robotsText: {__html: `<h1>Срочная+печать+на+футболках+в+Санкт-Петербурге</h1>
<p>Pinhead+Studio+предлагает+услуги+срочной+печати+на+футболках+в+Санкт-Петербурге.+Вам+нужна+футболка+с+принтом+сегодня?+Нет+проблем!+Мы+выполним+ваш+заказ+за+считанные+часы,+используя+самые+современные+технологии+печати.</p> 
<h2>Почему+стоит+выбрать+Pinhead+Studio?</h2> 
<ul> 
<li>Изготовим+футболку+с+вашим+дизайном+в+течение+24+часов.</li>
<li>Используем+только+профессиональное+оборудование+и+качественные+материалы,+чтобы+ваш+принт+был+ярким,+стойким+и+долговечным.</li>
<li>Печатаем+изображения+любой+сложности,+по+вашему+макету+или+с+помощью+нашего+дизайнера.</li>
<li>Предлагаем+выгодные+цены+на+срочную+печать+футболок.</li>
<li>Заказать+печать+можно+онлайн+или+в+нашей+студии+в+Санкт-Петербурге.</li> 
<li>Делаем+печать+на+белых+и+цветных+футболках.</li>
<li>Печатаем+на+футболках+из+разных+материалов+(хлопок,+полиэстер,+смесовые+ткани).</li>
<li>Печатаем+на+футболках+любых+размеров+(от+детских+до+взрослых).</li>
<li>Печатаем+на+футболках+с+карманами,+капюшонами+и+другими+элементами.</li> 
<li>Печатаем+на+футболках+ограниченным+тиражом.</li> 
</ul>
<h3>Закажите+срочную+печать+на+футболках+в+Pinhead+Studio</h3>
<p>Если+вам+нужна+срочная+печать+на+футболках+в+Санкт-Петербурге,+обращайтесь+в+Pinhead+Studio.+Мы+гарантируем+быструю+и+качественную+печать,+чтобы+вы+могли+получить+свои+изделия+в+кратчайшие+сроки.</p>
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Срочная печать на футболках в Санкт-Петербурге в Pinhead Studio',
            metaDescription: 'Экспресс печать на футболках в Санкт-Петербурге. Срочная печать на футболках от 24 часов в Pinhead Studio.',
            metaKeywords: 'срочная печать на футболках спб, экспресс, быстрая печать',
        }
    }, // срочная печать
]


/**
 * {
        slug: '',
        title: 'PRINTS >',
        subtitle: '',
        mainText: '',
        robotsText: {__html: ``},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: '',
            metaDescription: '',
            metaKeywords: '',
        }
    },
 */