import { TOptionsData } from "./types";
import silkMain from "../../../public/printingMethods/silk/main.webp";
import termoMain from "../../../public/printingMethods/termo/main.webp";
import silk1 from "../../../public/printingMethods/silk/1.webp";
import silk2 from "../../../public/printingMethods/silk/2.webp";
import silk3 from "../../../public/printingMethods/silk/3.webp";
import silk4 from "../../../public/printingMethods/silk/4.webp";
import silk5 from "../../../public/printingMethods/silk/5.webp";
import silk6 from "../../../public/printingMethods/silk/6.webp";



export const textileOptions: Array<TOptionsData> = [
    {
        slug: 'pechat-na-futbolkah',
        title: 'TEXTILE >',
        subtitle: 'Печать на футболках',
        mainText: `Это база! Футболка – самый популярный предмет гардероба в мире, а еще это самый простой и удобный способ напечатать что-нибудь – логотипы, мемы, фотки – все это даже без каких-либо знаний о дизайне и производстве одежды можно превратить в отличный мерч.
На футболке можно напечатать абсолютно всеми методами печати, это быстро, а если вдруг футболка разонравится, то всегда можно напечатать новую. В общем просто поверьте нам – футболка лучший вариант, когда не понятно что же именно хочется…
`,
        pros: '> Быстро,> Низкая стоимость,> Любые методы печати,> Универсально',
        cons: '> Отсутствуют',
        robotsText: {__html: `<h1>Печать+на+футболках+в+Санкт-Петербурге</h1>
<p>Печать+на+футболках+в+Санкт-Петербурге+от+Pinhead+Studio+—+это+возможность+создать+уникальные+изделия+с+вашим+дизайном.+Мы+предлагаем+печать+на+футболках+на+заказ,+обеспечивая+высокое+качество+и+доступные+цены.+Заказывайте+печать+от+1+шт+и+получайте+свою+футболку+быстро+и+недорого.</p> 
<h2>Преимущества+печати+на+футболках</h2>
<p>Печать+на+футболках+—+это+идеальный+способ+выразить+свою+индивидуальность+или+создать+брендированный+мерч.</p> 
<ul>
<li>Печать+на+футболках+с+вашим+дизайном:+возможность+создать+уникальный+принт+или+логотип.</li>
<li>Доступные+цены:+наши+услуги+печати+на+футболках+доступны+по+выгодным+ценам.</li>
<li>Изготовление+от+1+шт:+мы+принимаем+заказы+на+печать+от+одной+футболки+до+больших+партий.</li>
<li>Широкий+выбор+материалов:+печать+на+хлопковых,+полиэстеровых+и+смесовых+тканях.</li>
<li>Печать+на+черных+футболках:+возможность+нанесения+принтов+на+темные+ткани.</li>
<li>Конструктор+дизайнов:+онлайн-заказ+с+использованием+интерактивного+конструктора.</li>
<li>Печать+разных+форматов:+возможность+печати+форматов+А3+и+А4.</li>
<li>Оверсайз+футболки:+печать+на+футболках+разных+размеров+и+стилей.</li>
<li>Быстрое+изготовление:+срочная+печать+и+доставка+в+кратчайшие+сроки.</li> 
</ul> 
<h3>Процесс+заказа</h3>
<p>Процесс+заказа+печати+на+футболках+в+Pinhead+Studio+простой+и+удобный.+Вы+можете+сделать+заказ+онлайн+или+посетить+нашу+студию+в+Санкт-Петербурге.+Наши+специалисты+помогут+вам+подготовить+макет+и+предложат+пробный+оттиск+перед+запуском+в+производство.+Наша+цель+—+ваше+полное+удовлетворение+качеством+конечного+продукта.+Заказывайте+печать+на+футболках+в+Санкт-Петербурге+в+Pinhead+Studio.+Мы+гарантируем+высокое+качество+и+быструю+печать,+чтобы+вы+могли+получить+свои+изделия+в+кратчайшие+сроки.</p>
`},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать на футболках в Санкт-Петербурге на заказ со своим дизайном цены в Pinhead Studio',
            metaDescription: 'Печать на футболках на заказ со своим дизайном в Санкт-Петербурге. Футболки на заказ с печатью недорого в Pinhead Studio.',
            metaKeywords: 'печать на футболках спб, на заказ, со своим дизайном, недорого, от 1 шт, на своей футболке, цена, сделать, нанесение печати, заказать, печать на черных футболках, стоимость, брендирование, изготовление, а3, а4, мерч, конструктор, оверсайз, онлайн заказ, принт',
        }
    }, //печать на футболках
    {
        slug: 'pechat-na-tolstovkah',
        title: 'TEXTILE >',
        subtitle: 'Печать на толстовках',
        mainText: `Толстовки, зипки, худи с молнией – назови как угодно – вещь для тех, кому этот мир уже абсолютно понятен. Толстовки – это комфорт в квадрате, но, почему-то, их мерч-потенциал, как нам кажется, до конца не раскрыт. Возможно из-за относительно высокой цены и довольно требовательной к условиям печати ткани…..но если подготовить процесс хорошо, то получится долговечный и действительно удобный мерч из которого просто не хочется вылезать. По методам печати мы рекомендуем флекс, шелкографию, вышивку или дтф – оптимальные для таких тканей, а еще рекомендуем не располагать принты на карманах и через молнию.`,
        robotsText: {__html: `<h1>Печать+на+толстовках+в+Санкт-Петербурге</h1>
<p>Печать+на+толстовках+в+Санкт-Петербурге+от+Pinhead+Studio+это+возможность+создать+уникальные+и+качественные+изделия+с+индивидуальным+дизайном.+Мы+предоставляем+услуги+печати+на+толстовках+на+заказ,+гарантируя+высокое+качество+и+доступные+цены.+Получите+свою+толстовку+с+оригинальным+принтом+в+кратчайшие+сроки.</p>
<h2>Преимущества+печати+на+толстовках</h2>
<p>Печать+на+толстовках+предоставляет+широкие+возможности+для+выражения+своего+стиля+и+создания+уникального+мерча.</p> 
<ul>
<li>Печать+с+вашим+дизайном:+индивидуальные+принты+и+логотипы+на+толстовках.</li>
<li>Выгодные+цены:+предлагаем+доступные+цены+на+все+виды+печати.</li>
<li>Минимальные+тиражи:+принимаем+заказы+от+одной+толстовки+до+крупных+партий.</li>
<li>Разнообразие+материалов:+печать+на+разных+типах+тканей,+включая+хлопок+и+полиэстер.</li>
<li>Срочное+изготовление:+быстрая+печать+и+доставка+по+Санкт-Петербургу.</li>
<li>Качество+печати:+используем+новейшие+технологии+и+материалы+высокого+качества.</li>
<li>Сложные+дизайны:+создаем+принты+любой+сложности+и+формата.</li>
</ul> 
<h3>Процесс+заказа</h3>
<p>Процесс+заказа+печати+на+толстовках+в+Pinhead+Studio+прост+и+удобен.+Вы+можете+оформить+заказ+онлайн+или+посетить+нашу+студию+в+Санкт-Петербурге.+Наши+специалисты+помогут+вам+с+разработкой+макета+и+предложат+пробный+оттиск+перед+началом+производства.+Обратившись+в+Pinhead+Studio+для+печати+толстовок+в+Санкт-Петербурге,+вы+получите+не+только+качественный+продукт,+но+и+быстрое+выполнение+вашего+заказа.+Позвольте+нам+воплотить+ваши+идеи+в+жизнь.</p>
`},
        pros: '> Удобно,> УДОБНО,> Долговечно',
        cons: '> Ограничения по методам печати',    
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать на толстовках в Санкт-Петербурге на заказ со своим дизайном цены в Pinhead Studio',
            metaDescription: 'Печать на толстовках на заказ в Санкт-Петербурге по выгодной цене. Заказать толстовки со своим дизайном принта от 1 штуки в Pinhead Studio.',
            metaKeywords: 'печать на толстовках спб, на заказ, с принтом, свой дизайн, заказать, сделать, мерч, цена, срочно, 1 шт',
        }
    }, //печать на толстовках
    {
        slug: 'pechat-na-hudi',
        title: 'TEXTILE >',
        subtitle: 'Печать на худи',
        mainText: 'Это база №2 после футболок – есть у каждого. Заказать худи с принтом (особенно в дополнение к футболке) – всегда хорошая идея. Кроме того это почти всегда универсально из-за довольно свободного кроя и особенно актуально осенью-зимой. Наилучшие методы печати – шелкография, флекс, дтф, вышивка. Как и на любом другом текстиле мы не советуем размещать принты через швы.',
        robotsText: {__html: `<h1>Печать+на+худи+в+Санкт-Петербурге</h1>
<p>Ищете+уникальное+худи?+Pinhead+Studio+предлагает+персонализированную+печать+на+худи+под+заказ.+Создайте+собственный+дизайн+или+выберите+один+из+наших+макетов,+и+мы+реализуем+вашу+идею+с+помощью+современных+технологий+печати.</p>
<h2>Почему+выбирают+Pinhead+Studio?</h2>
<p>Мы+предлагаем+не+только+печать,+но+и+полную+поддержку+в+реализации+вашего+творческого+замысла.</p> 
<ul>
<li><strong>Творческая+свобода:</strong>+полная+кастомизация+худи+—+от+цвета+до+дизайна.</li>
<li><strong>Технологичность:</strong>+используем+современные+технологии+для+яркости+и+долговечности+изображений.</li>
<li><strong>Качество+материалов:</strong>+используем+высококачественные+ткани+для+комфорта+и+износостойкости.</li>
<li><strong>Быстрое+выполнение+заказов:</strong>+оптимизированный+процесс+печати+сокращает+время+изготовления.</li> 
</ul>
<h3>Как+заказать+индивидуальное+худи+в+Pinhead+Studio?</h3>
<p>Заказать+худи+легко+—+независимо+от+того,+нужен+ли+вам+один+экземпляр+или+целая+партия.+Разработайте+дизайн+с+помощью+наших+специалистов+или+пршлите+нам+свой+макет.+Получите+ваше+худи+прямо+с+доставкой+от+Pinhead+Studio+уже+сегодня!</p>
`},
        pros: '> Долговечно,> Универсально,> Удобно',
        cons: '> Ограничение методов печати',
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать на худи в Санкт-Петербурге на заказ в Pinhead Studio',
            metaDescription: 'Заказать печать на худи в Санкт-Петербурге в Pinhead Studio. Печать на худи с вашим принтом на заказ.',
            metaKeywords: 'печать на худи спб, на заказ, принт, мерч, заказать',
        }
    }, //печать на худи
    {
        slug: 'pechat-na-svitshotah',
        title: 'TEXTILE >',
        subtitle: 'Печать на свитшотах',
        mainText: 'Свитшоты очень неоднозначная вещь. Обычно к ним относятся строго полярно – либо любят, либо не очень, поэтому если уверенности нет, то возможно будет лучше посмотреть в сторону толстовок, худи или лонгсливов, но если решение принято, то мы посоветуем те же методы печати, что и для толстовок – шелкографию, дтф, флекс, вышивку, а кроме этого дтг, но только если свитшоты белые.',
        robotsText: {__html: `<h1>Печать+на+свитшотах+в+Санкт-Петербурге</h1>
<p>Pinhead+Studio+в+Санкт-Петербурге+предлагает+индивидуальное+изготовление+свитшотов+с+принтами+на+заказ.+Создайте+свой+уникальный+дизайн+или+выберите+один+из+предложенных+нами+макетов.</p>
<h2>Преимущества+нашей+печати</h2>
<p>В+Pinhead+Studio+вы+найдете+широкие+возможности+кастомизации</p>
<ul>
<li><strong>Многообразие+дизайнов:</strong>+печать+любых+изображений+от+простого+текста+до+сложных+многоцветных+рисунков.</li>
<li><strong>Высококачественные+материалы:</strong>+используем+современные+краски+и+ткани,+что+гарантирует+долговечность+и+яркость+принта.</li>
<li><strong>Технология+печати:</strong>+отличное+качество+благодаря+передовым+технологиям+печати,+обеспечивающим+четкость+каждой+детали.</li>
<li><strong>Быстрая+реализация:</strong>+срочное+выполнение+заказов,+возможность+получения+продукции+в+кратчайшие+сроки.</li> 
</ul>
<h3>Как+заказать+печать+на+свитшоте?</h3>
<p>Вы+можете+предоставить+собственный+макет+или+разработать+его+с+помощью+наших+дизайнеров.+Мы+предоставим+вам+пробный+оттиск+для+утверждения+перед+печатью.+Заказывайте+печать+на+свитшотах+в+Pinhead+Studio+и+выражайте+свою+индивидуальность+через+уникальные+дизайны!</p>
`},
        pros: '> Больше опций нанесения',
        cons: '> Не все любят свитшоты',
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: 'Печать на свитшотах в Санкт-Петербурге заказать изготовление в Pinhead Studio',
            metaDescription: 'Свитшоты с принтом на заказ в Санкт-Петербурге. Заказать изготовление свитшотов с печатью в Pinhead Studio.',
            metaKeywords: 'свитшот с принтом на заказ, печать, спб, заказать, изготовление',
        }
    }, //печать на свитшотах
]


/**
 * {
        slug: '',
        title: 'TEXTILE >',
        subtitle: '',
        mainText: '',
        robotsText: {__html: ``},
        cover: silkMain,
        gallery: [silk1, silk2, silk3, silk4, silk5, silk6],
        meta: {
            metaTitle: '',
            metaDescription: '',
            metaKeywords: '',
        }
    },
 */